/**********************************************************************************
 *
 * file             : me2fs_util.h
 * Descriptions     : Define for my ext2 filesystem  utilities
 *
 **********************************************************************************/

// マクロで __ME2FS_UTIL_H__ が宣言されていないなら __ME2FS_UTIL_H__ を宣言する(include guard)
// ifndefは、 #if ! defined の代わりに使える
// ifndefから始まる条件付き処理は、最終行のendifまで続いている点に注意

#ifndef __ME2FS_UTIL_H__
#define __ME2FS_UTIL_H__

/*
====================================================================================

  Prototype Statement

====================================================================================
*/

/*
====================================================================================

  Defines

====================================================================================
*/

#define ME2FS_DEBUG

#ifdef  ME2FS_DEBUG
  #define DBGPRINT( msg, args... ) do {printk( KERN_INFO msg, ##args );} while (0)
#else
  #define DBGPRINT( msg, args... ) do { } while( 0 )
#endif

#define ME2FS_ERROR( msg, args... ) do {printk( KERN_ERR msg, ##args );} while( 0 )

/*
====================================================================================

  Management

====================================================================================
*/

/*
====================================================================================
  < Open Functions >
====================================================================================
*/

#endif // __ME2FS_UTIL_H__
